[
{
  "keywords": ["hello", "hi", "greetings", "howdy"],
  "responses": [
    "Hey! What’s on your mind today?",
    "Hello! Got any questions or ideas to chat about?",
    "Hi there! Ready to dive into anything specific?",
    "Hello there! Feel free to start with anything you'd like to discuss."
  ]
},
{
  "keywords": ["coding", "debugging", "project", "technical"],
  "responses": [
    "Debugging can be a bit like detective work. Sometimes it’s all about patience and persistence.",
    "Honestly, coding is a mix of art and science. I always try to focus on clean, readable code—it saves a ton of headaches later.",
    "I’m all about incremental progress on projects. Small steps really do add up, especially when tackling complex problems.",
    "Coding has its challenges, but it’s also rewarding! What’s your current focus?",
    "Whether it’s coding or debugging, each step teaches something new. How’s your project going?"
  ]
},
{
  "keywords": ["virtual pet", "pet", "app", "game", "tone detection", "tone", "detection", "sentiment analysis", "sentiment", "analysis"],
  "responses": [
    "The Virtual Pet Web Application lets users interact with a pet by feeding, cleaning, and training it. It even detects your tone using sentiment analysis, creating a responsive experience.",
    "This project is all about creating a fun, interactive experience. Users can care for their virtual pets and see the effects in real-time.",
    "Sentiment analysis makes interactions with virtual pets feel more personal. It’s interesting to see how users respond to that feature!",
    "This app combines interaction and emotion, giving users a unique experience with their virtual pet.",
    "The sentiment analysis aspect adds a layer of connection to the virtual pet experience."
  ]
},
{
  "keywords": ["map app", "map", "app", "collaborative maps", "collaborative", "maps", "listing", "Leaflet", "points"],
  "responses": [
    "The Map Listing Web Application allows users to collaboratively create maps with multiple points of interest. It's great for organizing location-based info.",
    "Maps are a great way to visually organize information, and this project takes it a step further with collaboration.",
    "Collaborative maps make it easier to share locations and points of interest with others.",
    "This app helps users add and view points on a map in real-time. A great tool for location-based information.",
    "Maps can be incredibly versatile in sharing information, and collaborating on them opens up a lot of possibilities."
  ]
},
{
  "keywords": ["sleep chatbot", "sleep", "wellness", "chatbot", "sleep assistant", "assistant"],
  "responses": [
    "The Sleep Wellness Chatbot is designed to assist users with sleep-related guidance through a chat interface.",
    "Good sleep is essential, and this chatbot provides some helpful guidance to promote wellness.",
    "Sleep wellness is the focus here, using conversational tips to improve habits.",
    "Helping users with sleep through a chatbot is a unique approach to wellness.",
    "This project uses advanced AI models and offers advice on healthy sleep habits."
  ]
},
{
  "keywords": ["facemask detection", "facemask", "mask", "detection", "YOLO", "COVID-19", "mask app", "app"],
  "responses": [
    "The Facemask Detection App was created during COVID-19 to detect if someone is wearing a mask using their phone’s camera.",
    "Real-time mask detection was a timely solution during COVID-19, and this app made it accessible.",
    "Mask detection technology like this can be really helpful for public health and safety.",
    "Using YOLOv2 for detecting facemasks was a creative way to contribute to health efforts.",
    "A helpful tool during COVID-19, this app leveraged mobile technology for public safety."
  ]
},
{
  "keywords": ["student webpage creator", "student", "webpage", "creator", "profile generator", "profile", "generator", "dynamic profile", "dynamic", "single-page app", "single-page", "SFU"],
  "responses": [
    "The SFU Student Webpage Creator helps generate student profile webpages with features like saving, downloading, and text editing.",
    "A profile generator like this can save a lot of time for students creating web pages.",
    "Creating a dynamic student profile page is streamlined with this tool.",
    "This single-page app helps students build and manage profiles easily.",
    "Automating profile creation is a big time-saver for students and institutions."
  ]
},
{
  "keywords": ["travel app", "travel", "prototype", "Figma prototype", "Figma", "user testing", "testing", "UX research", "UX", "research"],
  "responses": [
    "The Travel App Figma Prototype was designed to address user pain points in the travel experience.",
    "User testing and feedback are essential for making travel apps that actually help users.",
    "With travel in mind, this prototype incorporates real user feedback to improve the design.",
    "A well-researched travel app can make planning and managing trips easier for everyone.",
    "Through UX research and feedback, this prototype evolved to meet user needs more effectively."
  ]
},
{
  "keywords": ["bakery website", "bakery", "website", "redesign", "user experience", "experience", "UX"],
  "responses": [
    "The Bakery Website Redesign improved user navigation, making it easy for customers to find and purchase items.",
    "Designing for a bakery website means focusing on an enjoyable browsing experience.",
    "An accessible and visually appealing redesign can make a big difference for users.",
    "Streamlined navigation is key for a great user experience, especially for e-commerce sites.",
    "A smooth browsing experience is essential in making online shopping easy and enjoyable."
  ]
},
{
  "keywords": ["smart drive test", "smart", "drive", "test", "driving platform", "driving", "platform", "learning platform", "learning", "course", "website"],
  "responses": [
    "The Smart Drive Test project is a learning platform that teaches driving techniques and supports new drivers.",
    "Helping people learn to drive safely is the core purpose of this platform.",
    "Driving courses like these make it easier for learners to build confidence on the road.",
    "A solid foundation in driving can make a big difference, and this platform helps with that.",
    "This project focuses on providing useful resources for those learning to drive."
  ]
},
{
  "keywords": ["City of Vancouver", "City", "Vancouver", "voting website", "voting", "website", "wireframes", "city project", "project"],
  "responses": [
    "For the City of Vancouver, I worked on a voting website project focusing on usability and accessibility.",
    "Ensuring the voting website is easy to navigate was a top priority.",
    "City projects like these are about making information accessible to everyone.",
    "Creating user-centered experiences for city residents is essential in public projects.",
    "Design choices in civic projects need to align with accessibility standards, which was key in this project."
  ]
},
{
  "keywords": ["profile helper", "profile", "helper", "student profile", "student", "Adobe Experience Manager", "Adobe", "Experience", "Manager", "automation"],
  "responses": [
    "The Profile Helper automated the creation of student profiles, streamlining the process.",
    "Automating profile creation saves time and ensures consistency across profiles.",
    "This project allowed for quicker and more efficient profile management.",
    "Profile automation tools like this help teams stay organized and manage content easily.",
    "Creating a tool to automate profiles can be a big productivity booster."
  ]
},
{
  "keywords": ["UX research", "research", "user stories", "stories", "usability testing", "usability", "testing", "information architecture", "information", "architecture"],
  "responses": [
    "UX research is at the heart of my projects, focusing on improving the user experience.",
    "Understanding user behavior through research is essential in design.",
    "From usability testing to storyboarding, UX research helps shape effective designs.",
    "Each project begins with in-depth research to make sure we’re meeting user needs.",
    "Usability testing and story mapping are key parts of creating intuitive user interfaces."
  ]
},
{
  "keywords": ["portfolio", "projects", "deployment", "showcase", "tech stack", "tech", "stack"],
  "responses": [
    "I’m constantly updating my portfolio to showcase projects and skills.",
    "A well-rounded portfolio highlights various skills and projects.",
    "Deployment is a crucial step in showcasing work, making it accessible to users.",
    "Highlighting different tech stacks in a portfolio shows versatility.",
    "Sharing live projects gives others a chance to interact with the work directly."
  ]
},
{
  "keywords": [ "what's your name",
  "whats your name",
  "what is your name",
  "whats ur name",
  "name",
  "who are you",
  "who r u",
  "whats ur nam",
  "wat is ur name",
  "what name do you go by",
  "who am I speaking with",
  "who am i chatting with",
  "can you introduce yourself",
  "tell me your name",
  "how should I call you",
  "call you",
  "do you have a nickname",
  "do you have a preferred name",
  "do u have a name"],
 
  "responses": [
    "You can call me Sorren.",
    "I’m Sorren Jao, but Sorren is fine!",
    "Just call me Sorren.",
    "My full name is Sorren Jao, but feel free to just say Sorren."
  ]
},
{
  "keywords": ["what's up", "how are you","how's it going", "what's going on"],
  "responses": [
    "Just here, ready to help! How’s everything with you?",
    "I’m doing great! Always up for a good coding question or chat. What’s on your mind?",
    "All good here! Working on projects and happy to help with any you have!",
    "I’m here, ready to dive into anything you want to discuss. What’s going on with you?"
  ]
},
{
  "keywords": ["what's your favorite thing to do",  "activity", "fun"],
  "responses": [
    "I love working on creative coding projects, especially ones that mix art with tech!",
    "Experimenting with new tech stacks is always exciting. It feels like solving a puzzle every time.",
    "Creating interactive experiences is always enjoyable.",
    "Building interfaces that users enjoy is super rewarding.",
    "Coding projects that involve creativity make it even more fun!"
  ]
},
{
  "keywords": ["help with coding", "help", "coding", "code", "assist", "programming", "help me code"],
  "responses": [
    "Absolutely! What are you working on? I’d love to see if I can help.",
    "Of course! Just let me know what you need help with, and we can break it down together.",
    "Sure thing! Coding challenges are always welcome here. What do you need help with?",
    "I’d be happy to assist! Sometimes, a fresh perspective can make all the difference. What’s the issue?",
    "Let’s tackle this together. Walk me through what’s going on with your code, and I’ll do my best to help!"
  ]
},
{
  "keywords": ["tell me about yourself",  "yourself", "who are you", "your background", "background", "what do you do"],
  "responses": [
    "I’m Sorren Jao, a web developer with a background in interactive design and virtual pet games.",
    "I just finished a bootcamp and completed a degree in interactive arts and technology, focusing on web dev.",
    "I’ve worked on various projects, from virtual pets to sentiment-based chatbots and collaborative maps.",
    "My experience spans frontend and backend dev, with hands-on work in React, Rails, and SQL.",
    "I'm passionate about creating interactive experiences, especially ones that blend code with creativity."
  ]
},
{
  "keywords": ["how do you relax",  "relax", "free time", "free", "time", "when not coding",  "hobbies"],
  "responses": [
    "When I’m not coding, I enjoy exploring new tech trends or checking out other developers’ projects for inspiration.",
    "In my free time, I like experimenting with new tools or frameworks. It keeps things interesting!",
    "Outside of work, I enjoy reading up on tech and design advancements.",
    "A bit of gaming is fun too—it’s relaxing and sometimes inspires new ideas.",
    "I like reading about UX design practices to keep a fresh perspective on user interactions."
  ]
}
]